Revit 2024 API
LocationPoint.Rotation Property
The angle of rotation around the insertion point, in radians.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Rotation { get; }
Visual Basic
Public ReadOnly Property Rotation As Double
	Get
Visual C++
public:
property double Rotation {
	double get ();
}
Remarks
For view-based elements, the rotation angle is in the plane of the associated view. For model elements, the rotation angle is measured relative to the default coordinate system. This property is not supported for some elements supporting LocationPoints, such as AssemblyInstances, Groups, ModelText, Room, and SpotDimensions.
See Also
LocationPoint Class
Autodesk.Revit.DB Namespace